class YaScooterHomePageFAQ:
    answer0 = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    answer1 = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    answer2 = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    answer3 = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    answer4 = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    answer5 = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    answer6 = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    answer7 = "Да, обязательно. Всем самокатов! И Москве, и Московской области."


class YaScooterOrderPageData:
    data_sets = {
        'data_set1': {
            'first_name': 'Виктор',
            'last_name': 'Иванов',
            'address': 'Москва, улица Достоевского, дом 2',
            'subway_name': 'Марьино',
            'telepthone_number': '79091556778',
            'date': '12.09.2023',
            'rental_period': 0,
            'color': [0],
            'comment_for_courier': 'У шлагбаума злая собака',
            'description': 'Корректные данные'
        },
        'data_set2':
            {'first_name': 'Вася',
             'last_name': 'Пряник',
             'address': 'Москва, улица Зои и Александра Космодемьянских',
             'subway_name': 'Войковская',
             'telepthone_number': '79100956578',
             'date': '12.09.2023',
             'rental_period': 1,
             'color': [0, 1],
             'comment_for_courier': 'Самокат лучше с сиденьем',
             'description': 'Корректные данные'
             },
    }